HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEray_bf.h
/**
 * \file IfxEray_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Eray_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Eray_Registers
 * 
 */
#ifndef IFXERAY_BF_H
#define IFXERAY_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Eray_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.DISR */
#define IFX_ERAY_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.DISS */
#define IFX_ERAY_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.EDIS */
#define IFX_ERAY_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_LEN (3u)

/** \brief Mask for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_MSK (0x7u)

/** \brief Offset for Ifx_ERAY_CLC_Bits.RMC */
#define IFX_ERAY_CLC_RMC_OFF (8u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_OFF (0u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_OFF (1u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_OFF (2u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_OFF (3u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_OFF (4u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_LEN (1u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_OFF (7u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_LEN (2u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_OFF (10u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_LEN (2u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_OFF (12u)

/** \brief Length for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_LEN (2u)

/** \brief Mask for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_OFF (14u)

/** \brief Length for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_ID_Bits.MOD_REV */
#define IFX_ERAY_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_ID_Bits.MOD_TYPE */
#define IFX_ERAY_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_ERAY_ID_Bits.MOD_NUMBER */
#define IFX_ERAY_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_ERAY_ID_Bits.MOD_NUMBER */
#define IFX_ERAY_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_ERAY_ID_Bits.MOD_NUMBER */
#define IFX_ERAY_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_LEN (32u)

/** \brief Mask for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_MSK (0xffffffffu)

/** \brief Offset for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_OFF (0u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_OFF (0u)

/** \brief Length for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_LEN (1u)

/** \brief Mask for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_TEST1_Bits.ELBE */
#define IFX_ERAY_TEST1_ELBE_OFF (1u)

